feature/fiturfeedback/app/controllers/v1/feedbacks_controller.rb

SELECT "feedbacks".* FROM "feedbacks"
---
    def index
      @feedbacks = Feedback.all

INSERT INTO "feedbacks" ("username", "pesan", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "hokey"], ["pesan", "it's easy to use so amazing"], ["created_at", "2018-05-26 16:14:33.336460"], ["updated_at", "2018-05-26 16:14:33.336460"]]
---
    def create
      @feedback = Feedback.new(feedback_params)
      if @feedback.save

UPDATE "feedbacks" SET "pesan" = $1, "updated_at" = $2 WHERE "feedbacks"."id" = $3  [["pesan", "it's easy"], ["updated_at", "2018-05-26 16:22:36.178701"], ["id", 2]]
---
    def update
      if @feedback.update(feedback_params)

SELECT  "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def set_feedback
        @feedback = Feedback.find(params[:id])