app/controllers/artists_controller.rb

  def create
    @artist = Artist.new(artist_params)

    if @artist.save
---
INSERT INTO "artists" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "pascales"], ["email", "myemail@gmail.com"], ["created_at", "2018-05-17 14:35:50.003258"], ["updated_at", "2018-05-17 14:35:50.003258"]]