app/controllers/lukisans_controller.rb

SELECT "lukisans".* FROM "lukisans"
---
  def index
    @lukisans = Lukisan.all

INSERT INTO "lukisans" ("title", "description", "imagepath", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "art keren"], ["description", "ini keren banget sumpah"], ["imagepath", "anu.com/anu.jpg"], ["created_at", "2018-05-17 14:42:49.032217"], ["updated_at", "2018-05-17 14:42:49.032217"]]
---
  def create
    @lukisan = Lukisan.new(lukisan_params)

    if @lukisan.save

UPDATE "lukisans" SET "title" = $1, "updated_at" = $2 WHERE "lukisans"."id" = $3  [["title", "Edit Reflejos rojos"], ["updated_at", "2018-05-18 03:08:50.701006"], ["id", 4]]
---
  def update
    if @lukisan.update(lukisan_params)

DELETE FROM "lukisans" WHERE "lukisans"."id" = $1  [["id", 1]]
---
  def destroy
    @lukisan.destroy

SELECT  "lukisans".* FROM "lukisans" WHERE "lukisans"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_lukisan
      @lukisan = Lukisan.find(params[:id])